<!DOCTYPE html>
<!-- saved from url=(0050)http://wayneluke.com/testing/vb5readme/readme.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>vBulletin 5 Connect - LiesMich</title>
<style>
body { background-color: #E9E9E9;font-family: Calibri, Tahoma, Verdana, Segoe, sans-serif;font-size: 1em;margin:0;width:100%;}
blockquote {border-left: 6px solid #ccc;margin: 1.5em 10px;padding: 0.5em 10px;}
code {font-family: Consolas, monaco, "Lucida Console", "Courier New", monospace;}
dfn {border-bottom: 1px dashed black; cursor:help;}
footer {font-family: Arial, sans-serif;top: 59px;width:90%;max-width: 1200px;min-width: 720px;margin: 0 auto;font-size: .6em;}
header {width:inherit;background-color: #000;background-image: url("./upload/core/cpstyles/vBulletin_5_Default/admincp_hd_back.png");height: 57px;border-bottom:1px solid #000;top:0;position:absolute}
h1 {margin-top:0px; padding-top: 15px;}
hr {width: 62%; text-align:center;}
section {clear:both; padding-bottom:20px}

#content {top:65px;width:90%;max-width: 1200px;min-width: 720px;margin: 0 auto;background-color: #fff;padding: 65px 24px;padding-bottom: 24px;border-bottom-left-radius:4px;border-bottom-right-radius:4px;}
#header_content {width:90%;max-width: 1200px;min-width: 720px;margin: 0 auto;color: #FFF;}

.logo {left:10px;margin:0;padding:0;}
.headlinks{font-size: 10pt; text-align:right;margin-top:-20px;}
.headlinks a:link,.headlinks a:visited,.headlinks a:hover{color: white !important;text-decoration:none}
.top{clear:both;font-size:9pt;text-transform:uppercase;color:#c8c8c8;text-align:right}

.infobox {height: 250px; width: 45%; border: 1px solid #000; float:left; margin:0 15px; margin-bottom: 18px;}
.infobox h3 {font-size: 10pt; margin-top: 0px; background-color: #000; color: #fff; text-align:center;}
.infobox p { padding: 0 12px;}
dl.faq > dt {font-weight:bold;padding_bottom: 4px;}
dl.faq > dt:before {content: "Q. ";}
dl.faq > dd:before {content: "A. ";}
dl.faq > dd {padding-bottom: .6em;margin-left: 0px;}
</style>
</head>
<body>
<header>
	<section id="header_content">
    <img class="logo" src="./vBulletin 5 Connect - Readme and Installation Guide_files/cp_logo.png" width="155" height="45" alt="">
    <div class="headlinks"><a href="https://members.vbulletin.com/">Kundenbereich</a> • <a href="https://www.vbulletin.com/forum/">Kundenforum</a> • <a href="https://www.vbulletin.com/go/techsupport">Technische Unterstützung</a> • <a href="https://www.vbulletin.com/docs/html/">Handbuch</a></div>
	</section>
</header>
<div id="content">
	<a name="top"></a>
	<h1>LiesMich und Installationsanleitung</h1>
	
	<div class="wrap" id="toc">
		<h2><a name="toc"></a>Inhalt</h2>
		<section>
			<ul>
				<li><a href="#new">Was ist neu in vBulletin 5 Connect?</a></li>
				<li><a href="#req">Systemanforderungen</a></li>
				<li><a href="#terms">Begriffe und Software</a></li>
				<li><a href="#install">vBulletin 5 Connect installieren</a></li>
				<li><a href="#upgrade">Auf vBulletin 5 Connect aktualisieren</a></li>
				<li><a href="#language">vBulletin in anderen Sprachen</a></li>
				<li><a href="#faq">Häufig gestellte Fragen</a></li>
				<li><a href="#append">Anhang: Links zu weiteren Informationen</a></li>
			</ul>
			<hr>
		</section>
    </div>
	
	<a name="new"></a>
	<div class="wrap" id="whatsnew">
		<h2>Was ist neu in vBulletin 5 Connect?</h2>
		<section>
			<p><b>Site Builder</b> - Eine der grundlegendsten, neuen Funktionen in 
		vBulletin 5 Connect ist der Site Builder. Damit k&ouml;nnen Seiten erstellt 
		und verwaltet werden. Neue Elemente k&ouml;nnen einfach mit der Maus an die 
		gew&uuml;nschte Position gezogen werden. Mit dem Style-Generator bekommen die 
		neuen Seiten auf einfache Art und Weise ein farbiges Aussehen.</p>
            <p><strong>Alles ist Inhalt</strong> - Mit vBulletin 5 haben wir die 
              Idee verfolgt, dass einfach alles Inhalt ist. Dies geschieht mit einer 
              neuen Verwaltung von Inhalten bestehend aus Kan&auml;len, Knoten und eben den 
              entsprechenden Inhalten. Alle Inhalte funktionieren auf die gleiche Art 
              und Weise, sind durchsuchbar und nutzen ein modernes Eingabesystem. 
              Benutzer k&ouml;nnen Inhalte nun noch intuitiver hinzuf&uuml;gen.</p>
            <p><b>Ne</b><strong>ue Suche</strong> - Die Suchfunktion wurde eben neu 
              ausgerichtet, damit alle Inhalte gefunden werden k&ouml;nnen. Die neu 
              erstellte Suchfunktion bietet verbesserte Ergebnisse und mehr Details.</p>
            <p><b>MVC-Architektur </b>- vBulletin 5 Connect f&uuml;hrt eine neue 
              MVC-Architektur ein, welche erstmals die Pr&auml;sentationsebene von der 
              Kernebene trennt. Damit bleibt vBulletin 5 schnell und einfach zu 
              erweitern, w&auml;hrend wir neue Funktionen hinzuf&uuml;gen.</p>
            <p><b>Responsives Design</b> - Mittlerweile werden Ger&auml;te mit 
              unterschiedlichen Bildschirmgr&ouml;&szlig;en verwendet. Dazu z&auml;hlen Smartphones, 
              Tablets und ultrahochaufl&ouml;sende Monitore. Mit dem inkludierten 
              responsiven Design wird vBulletin 5 immer in der passenden Gr&ouml;&szlig;e 
              angezeigt. Damit m&uuml;ssen Sie sich keine Gedanken &uuml;ber mobile Styles oder 
              Anpassungen f&uuml;r bestimmte Ger&auml;te verschwenden. vBulletin wird dann 
              automatisch in der richtigen Bildschirmgr&ouml;&szlig;e angezeigt.</p>
            <p><b>Erweiterte API</b> - Die API von vBulletin wurde erweitert. Nicht 
              nur mobile Apps k&ouml;nnen von den Vorteilen der App profitieren, sondern 
              auch erstmals die Webansicht ebenso. Damit wird das Aussehen besser 
              strukturiert und Sie m&uuml;ssen Funktionen nur einmal erstellen, w&auml;hrend es 
              egal ist wie darauf zugegriffen wird.</p>
			<div class="top"><a href="#top">Hinauf</a></div><hr>
		</section>	
	</div>
	
	<a name="req"></a>
	<div class="wrap" id="system">
		<h2>Systemanforderungen</h2>
		<section>
			<p>Um vBulletin installieren zu k&ouml;nnen, ben&ouml;tigen Sie einen Server mit den unten angeforderten Anforderungen. Au&szlig;erdem ben&ouml;tigen Sie eine registrierte Domain. Diese Domain sollte dann zu Ihrem Webserver verweisen. Falls Sie Hilfe bei der Einrichtung des Domain Name Services (DNS) ben&ouml;tigen, kann Ihnen Ihr Hosting Provider behilflich sein.</p>
			<div class="infobox" id="minimum">
				<h3>Minimale Systemanforderungen</h3>
				<p>Damit vBulletin funktionieren, ben&ouml;tigen Sie folgende Voraussetzungen:</p>
				<ul>
					<li>Apache 2.2+, IIS 7+ oder NGINX 1.4+</li>
					<li>PHP 5.6.0</li>
					<li>MySQL 5.5.9</li>
					<li>mod_rewrite, URL Rewrite oder Vergleichbares.</li>
					<li>Zusätzliche PHP-Module: MySQLi, cURL, OpenSSL-Unterst&uuml;tzung, iconv, mbstring, JSON-Unterstützung, XML-Unterstützung</li>
				</ul>
			</div>
			<div class="infobox" id="recommended">
				<h3>Empfohlene Systemanforderungen</h3>
				<p>Zus&auml;tzlich zu den minimalen Systemanforderungen verbessern die folgenden Anforderungen das Nutzererlebnis:</p>
				<ul>
					<li>PHP 7.1+</li>
					<li>MySQL 5.7.0+</li>
					<li>MemcacheD</li>
					<li>SSL-Zertifikat - wird m&ouml;glicherweise  f&uuml;r einige Dienste ben&ouml;tigt</li>
				</ul>		
			</div>
		</section>
		<section>
			<dl class="faq">
				<dt>Wie kann ich &uuml;berpr&uuml;fen ob mein Server die minimalen Systemanforderungen erf&uuml;llt?</dt>
				<dd>Sie k&ouml;nnen von unserer Webseite ein  <a href="http://www.vbulletin.com/go/test/">Server Testskript</a> herunterladen. 
		  </dd></dl>
		    <div class="top"><a href="#top">HInAuF</a></div><hr>
		</section>
	</div>
	
	<a name="terms"></a>
	<div class="wrap" id="terminology">
		<h2>Begriffe und Software</h2>
		<section>
			<dl>
				<dt>FTP-Client/FTP-Programm</dt>
				<dd>FTP steht f&uuml;r File Transfer Protocol/Datei&uuml;bertragungsverfahren. Mit Hilfe eines FTP-Programms k&ouml;nnen Sie sich mit Ihrem Webserver verbinden um Dateien hoch- oder herunterzuladen. Wir empfehlen  <a href="https://filezilla-project.org/download.php">Filezilla</a>. Das Programm ist kostenlos, f&uuml;r die g&auml;ngigsten Betriebssysteme verf&uuml;gbar und bietet zahlreiche Funktionen.</dd>
				<dt>Texteditor</dt>
				<dd>Damit k&ouml;nnen einfache Textdateien bearbeitet werden. Zur Installation von vBulletin ist ein Texteditor notwendig. F&uuml;r Windows empfehlen wir  <a href="http://notepad-plus-plus.org/">Notepad++</a> und f&uuml;r Mac OS X TextEdit.</dd>
				<dt>Kundennummer</dt>
				<dd>Diese einzigartige Nummer wird von unserem System vergeben, um Sie als Kunde zu identifizieren. Die Nummer wird am Beginn einer Installation oder Aktualisierung ben&ouml;tigt. Falls Sie die Nummer nicht wissen, finden Sie diese im  <a href="http://members.vbulletin.com/">Kundenbereich</a>. Dort findet man die Kundennummer im oberen Bereich der Seite.</dd>
			  <dt>Lizenznummer</dt>
				<dd>Diese einzigartige Nummer ist mit einer bestimmten Lizenz verkn&uuml;pft. Normalerweise wird diese Nummer im Betrieb nicht ben&ouml;tigt.</dd>
				<dt>Ordner / Verzeichnis</dt>
				<dd>Diese zwei Begriffe als Speicherorte beziehen sich sowohl auf Ihren lokalen Computer und Ihren Webserver. Diese sind Synome und werden in der Dokumentation abwechselnd verwendet. </dd>
				<dt><code>domain_name</code></dt>
				<dd>Das ist der Name Ihrer Domain. Diese Adresse geben Sie in die Adressleiste Ihres Browsers ein.</dd>
				<dt><code>vbulletin_root</code></dt>
				<dd>In diesem Verzeichnis wird vBulletin installiert, zum Beispiel:  /public_html/forums</dd>
				<dt><code>vbulletin_core</code></dt>
				<dd>In diesem Verzeichnis wird die Kernebene und API installiert. Das Verzeichnis sieht dann so aus:  "vbulletin_root/core". Zum Beispiel: /public_html/forums/core</dd>
			</dl>
		    <div class="top"><a href="#top">Hinauf</a></div><hr>
		</section>	
	</div>
	
	<a name="install"></a>
	<div class="wrap" id="install">
		<h2> vBulletin 5 Connect installieren</h2>
		<section>
			<h3>vBulletin auf Ihren Server hochladen</h3>
			<ol>
				<li>Falls Sie es noch nicht getan haben, entpacken Sie das heruntergeladene vBulletin-Paket. Dieses enth&auml;lt alle Dateien f&uuml;r vBulletin sowie einige Tools zur Unterst&uuml;tzung.</li>
				<li>W&auml;hlen Sie ein Verzeichnis auf Ihrem Server aus, wo Sie vBulletin installieren wollen. Es gibt drei verschiedene M&ouml;glichkeiten:
					<ul>
					  <li>Falls vBulletin der Hauptteil Ihrer Seite sein wird, laden Sie die Dateien in das public_html oder httpdocs-Verzeichnis hoch. Manche Server verwenden auch ein www-Verzeichnis, welches zum richtigen Speicherort verweist.</li>
					  <li>Falls Sie bereits eine Webseite besitzen, m&ouml;chten Sie vBulletin m&ouml;glicherweise in einem Unterverzeichnis installieren. Dieses wird oftmals als &quot;forums&quot; bezeichnet. Dieses Verzeichnis muss am Server erstellt werden.</li>
						<li>Sie k&ouml;nnen vBulletin auch in einer Sub-Domain installieren. Diese muss zuerst auf Ihrem Server angelegt werden.</li>
					</ul>
				</li>
				<li>Finden Sie nun das Download-Archiv auf Ihrem Computer. Darin ist ein Verzeichnis namens  <code>Upload</code> enthalten. Diese Datei sollte sich im selben Ordner befinden. Der Name des Verzeichnis beginnt mit  <code>vB5_Connect_V_L</code>. Das V steht f&uuml;r die Versionsnummer und das L f&uuml;r die Lizenznummer.</li>
				<li>Laden Sie nun den Inhalt des <code>Upload</code>-Ordners in das gew&uuml;nschte Verzeichnis auf Ihrem Server hoch. Sie m&uuml;ssen nur die Inhalte des Ordners hochladen und nicht den Upload-Ordner selbst.</li>
			</ol>
			<h3>Ihre vBulletin Datenbank erstellen</h3>
			<p>vBulletin speichert alle Daten in einer MySQL-Datenbank. Um vBulletin zu installieren, ben&ouml;tigen Sie eine Datenbank. Wenn Sie eine Datenbank erstellen, notieren Sie den Datenbank-Server, den Serverport, den Namen der Datenbank, den Benutzernamen sowie das Kennwort. Sie ben&ouml;tigen diese Informationen sp&auml;ter. Falls Sie bei diesem Schritt Hilfe ben&ouml;tigen, kontaktieren Sie Ihren Hosting-Provider. Hier finden Sie einige n&uuml;tzliche Anleitungen um eine Datenbank zu erstellen:</p>
			<ul>
				<li><a href="http://dev.mysql.com/doc/refman/5.1/de/creating-database.html">SSH und MySQL-Befehle verwenden</a></li>
				<li><a href="http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CpanelDocs/MySQLDatabases#Create a Database">cPanel verwenden</a></li><a href="http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CpanelDocs/MySQLDatabases#Create%20a%20Database">
				</a>
				<li><a href="http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CpanelDocs/MySQLDatabases#Create%20a%20Database"></a><a href="http://download1.parallels.com/Plesk/PP11/11.0/Doc/de-DE/online/plesk-customer-guide/">Parallel's Plesk verwenden</a></li>
				<li><a href="http://www.brain-media.de/freebooks/Webmin.pdf">Webmin verwenden (pdf)</a>
		  </li></ul>
			<p>Falls keine der oben genannten Methoden funktioniert, kontaktieren Sie Ihren Hosting-Provider und bitten diese um Hilfe.</p>
			<h3>vBulletin Connect 5 installieren</h3>
			<ol>
				<li>Sobald Sie die Dateien in das gew&uuml;nschte Verzeichnis Ihres Servers hochgeladen haben, &ouml;ffnen Sie nun Ihren Web-Browser und geben Sie die folgende Adresse ein:  <dfn title="In diesem Verzeichnis wird Ihr vBulletin-Forum installiert. Beispiel: /public_html/forums">vbulletin_root</dfn> plus install/install.php.
			      <blockquote>Beispiel: http://www.example.com/forums/install/install.php</blockquote></li>
				<li>Nachdem dies Ihre erste Installation ist, leitet Sie das System automatisch zum Installationsassistenten weiter.</li>
				<li>Auf der ersten Seite werden Sie nach Ihrer Kundennummer gefragt. Geben Sie diese ein und klicken Sie danach auf &quot;Installation beginnen&quot;.</li>
				<li>Der Konfigurationsassistent erstellt die notwendigen config.php-Dateien f&uuml;r dich. F&uuml;llen Sie die folgende Felder aus:
					<ul>
					  <li>Cookie-Pr&auml;fix - Verwenden Sie den Standardwert bb</li>
						<li>Datenbank-Typ - vBulletin unterst&uuml;tzt mysql und mysqli, w&auml;hrend mysqli empfohlen wird.</li>
						<li>Datenbank-Name - Das ist der Name der Datenbank welchen Sie bei der Erstellung am Server festgelegt haben.</li>
						<li>Tabellen-Pr&auml;fix - Falls Sie keine weiteren Programme in der selben Datenbank verwenden, k&ouml;nnen Sie dieses Feld leer lassen.</li>
						<li>E-Mail-Adresse - Ihre E-Mail-Adresse</li>
						<li>Datenbank Server-Name - Wird von Ihrem Hosting-Provider festgelegt, meisten localhost.</li>
						<li>Datenbank Port-# - Verwenden Sie den Standardport  3306 au&szlig;er Ihr Hosting-Provider hat Ihnen etwas mitgeteilt.</li>
						<li>Datenbank Benutzername - Der Benutzername wurde beim Erstellen der Datenbank festgelegt. Falls Sie diesen nicht wissen, kontaktieren Sie Ihren Hosting-Provider.</li>
						<li>Datenbank-Kennwort - Das Kennwort wurde beim Erstellen der Datenbank festgelegt. Falls Sie dieses nicht wissen, kontaktieren Sie Ihren Hosting-Provider.</li>
						<li>Admincp-Verzeichnis - Hier k&ouml;nnen Sie den Standardwert admincp verwenden</li>
						<li>Modcp-Verzeichnis - Hier k&ouml;nnen Sie den Standardwert modcp verwenden</li>
					</ul>
				</li>
				<li>Klicken Sie auf  "Dateien erstellen"</li>
				<li>Das System sollte automatisch die config.php-Dateien erstellen und Ihnen die Nachricht &quot;Datei-Erstellung fertiggestellt&quot; ausgeben.</li>
				<li>Falls das System die config.php-Dateien nicht automatisch erstellen konnte, k&ouml;nnen Sie die Dateien auch <a href="#edit_files">manuell erstellen.</a></li>
				<li><a name="step_8"></a>Kehren Sie zur Installation zur&uuml;ck: http://www.example.com/forums/install/install.php.</li>
				<li>Klicken Sie auf "Installation beginnen".</li>
				<li>Befolgen Sie die Anleitungen. Es sollten zwei Dialogfenster erscheinen:
					<ul>
					  <li>Im ersten Dialogfenster m&uuml;ssen Sie den Namen Ihres Forums eintragen, sowie den Pfad zu Ihrem Forum und die E-Mail-Adresse des Webmasters.</li>
						<li>Im zweiten Dialogfenster m&uuml;ssen Sie einen Administrator erstellen.</li>
					</ul>
				</li>
			</ol>	
			<h3>Das Installationsverzeichnis l&ouml;schen</h3>
			<p>Sobald Sie vBulletin installiert haben, m&uuml;ssen Sie aus Sicherheitsgr&uuml;nden das Installationsverzeichnis l&ouml;schen. Der Ordner befindet sich im  <dfn title="In diesem Verzeichnis wird die Kernebene und API von vBulletin installiert. Dies wird zu &#39;vbulletin_root/core&#39;. Beispiel: /public_html/forums/core">vbulletin_core (Kernebene)</dfn> Ihres Servers. L&ouml;schen Sie das gesamte Verzeichnis samt dessen Inhalte. Bevor dies nicht getan wurde, k&ouml;nnen Sie das Administrator-Kontrollzentrum nicht aufrufen.</p>
			<h3><a name="edit_files"></a>Die config.php-Dateien manuell bearbeiten</h3>
			<p>Manchmal kann es passieren, dass der Konfigurations-Assistent die config.php-Dateien nicht erstellen kann. Sie m&uuml;ssen dann die Dateien manuell bearbeiten. Falls Sie den Konfigurations-Assistenten noch ge&ouml;ffnet haben, k&ouml;nnen Sie den Inhalt der einzelnen Felder kopieren und die Datei speichern. Alternativ k&ouml;nnen Sie die Dateien manuell mit einem Texteditor bearbeiten. F&uuml;hren Sie die folgenden Schritte aus: </p>
			<ol>
				<li>Finden Sie in Ihrem  <dfn title="In diesem Verzeichnis wird Ihr vBulletin-Forum installiert. Beispiel: /public_html/forums">vbulletin_root-Verzeichnis </dfn>die Datei config.php.bkp. Benennen Sie die mittels eines FTP-Programms in config.php um.</li>
				<li>Wechseln Sie in das <dfn title="In diesem Verzeichnis wird die Kernebene und API von vBulletin installiert. Dies wird zu &#39;vbulletin_root/core&#39;. Beispiel: /public_html/forums/core">vbulletin_core (Kernebene)</dfn> und in den includes-Ordner. Suchen Sie die Datei  config.php.new. Benennen Sie diese Datei in config.php um. Diese Datei muss von Ihnen bearbeitet werden. Falls Sie Filezilla verwenden, &ouml;ffnen Sie das Kontextmen&uuml; (Rechtsklick unter Windows) und w&auml;hlen Sie &quot;Ansehen/Bearbeiten&quot;. Sie werden gefragt, welches Programm verwendet werden soll. Wir empfehlen Notepadd++ oder Wordpad bzw. TextEdit (unter Mac OS X).</li>
				<li>Sie m&uuml;ssen einige Werte in dieser Datei bearbeiten, damit Sie sich mit der Datenbank verbinden und E-Mails mit Fehlermeldungen erhalten k&ouml;nnen. Diese Werte m&uuml;ssen angepasst werden:
					<dl>
					  <dt>Database Name: $config['Database']['dbname'] = 'forum';</dt>
						<dd>Ersetzen Sie forum durch den Namen Ihrer Datenbank.</dd>
						<dt>Server Name: $config['MasterServer']['servername'] = 'localhost';</dt>
						<dd>Ersetzen Sie localhost mit dem Namen Ihres Servers, falls dies notwendig ist.</dd>
						<dt>Server Port: $config['MasterServer']['port'] = 3306;</dt>
						<dd>Falls Ihr Hosting-Provider eine eigene Portnummer zur Verf&uuml;gung stellt, &auml;ndern Sie hier die Zahl 3306. Anonsten lassen Sie diesen Wert unver&auml;ndert.</dd>
						<dt>Database User Name: $config['MasterServer']['username'] = 'root';</dt>
						<dd>Ersetzen Sie root mit dem Namen des Datenbank-Benutzers.</dd>
						<dt>Database User Password: $config['MasterServer']['password'] = '';</dt>
						<dd>Setzen Sie zwischen den Anf&uuml;hrungszeichen das Datenbank-Kennwort ein.</dd>
						<dt>Technical Email $config['Database']['technicalemail'] = 'dbmaster@example.com';</dt>
						<dd> Ersetzen Sie dbmaster@example.com mit Ihrer E-Mail-Adresse.</dd>
					</dl>
					Falls Sie einen dieser Werte nicht wissen, kontaktieren Sie Ihren Hostingprovider. Der technische Support von vBulletin hat keinen Zugriff auf diese Informationen.</li>
				<li>Nachdem Sie die &Auml;nderungen durchgef&uuml;hrt haben, speichern Sie die Datei.</li>
				<li>&Ouml;ffnen Sie nun wieder Ihr FTP-Programm und laden Sie die Datei auf Ihren Server hoch. Falls Sie FileZilla im Hintergrund ge&ouml;ffnet haben, werden Sie automatisch aufgefordert die aktualisierte Datei hochzuladen.</li>
				<li>Sofern dies erledigt wurde, k&ouml;nnen Sie mit <a href="#step_8">Schritt 8</a> des Installationsassistenten fortfahren.</li>
			</ol>
			<h3>H&auml;ufige Probleme bei der Installation</h3>
			<dl class="faq">
				<dt>Ich habe das Forum installiert, sehe aber keine Farben und Formen</dt>
				<dd>Stellen Sie sicher, dass die Datei .htaccess (Apache), web.config (IIS), oder vhosts (NGINX) hochgeladen wurde.</dd>
				<dt>Der Assistent stoppt w&auml;hrend der Installation und bleibt inaktiv</dt>
				<dd>Manchmal kann es zu einem Server Timeout kommen. Aktualisieren die Seite und der Assistent f&auml;hrt an jener Stelle fort, wo er zuvor gestoppt hat.</dd>
			</dl>	
		    <div class="top"><a href="#top">HINAUF</a></div><hr>
		</section>
	</div>
	
	<a name="upgrade"></a>
	<div class="wrap" id="upgrade">
		<h2> Auf vBulletin 5 Connect aktualisieren</h2>
		<section>
			<h3>Ihre Datenbank sichern</h3>
			<p>Es wird empfohlen, eine vollst&auml;ndige Sicherung Ihrer Datenbank zu machen. F&uuml;r kleine Datenbanken (weniger als 50 MB) k&ouml;nnen Sie dies mit PHPMyAdmin tun. Ein anderes Programm ist MySQL Dumper. Die zuverl&auml;ssigste Methode zur Sicherung und Wiederherstellung von Datenbanken ist mit Shell-Zugriff mittels ssh. Falls Sie Ihre Datenbank mit einem PHP-Skript sichern wollen, kann dies zu PHP-Timeout-Fehlern und zu unvollst&auml;ndigen Sicherungsdateien f&uuml;hren. In Folge wird das Prozedere beschrieben:</p>
			<p>Um die Datenbank mit SSH zu sichern, f&uuml;hren Sie folgenden Befehl mittels Shell-Zugriff aus:</p><blockquote><code>mysqldump --opt -Q -u dbusername -p databasename &gt; backupname.sql</code></blockquote>
			Weitere Informationen finden Sie hier: <a href="http://www.vbulletin.com/docs/html/maintenance_ssh_backup">http://www.vbulletin.com/docs/html/maintenance_ssh_backup</a>
<p></p>
			<p>Falls Sie keinen Shell-Zugriff haben, bietet Ihr Hosting-Provider meist andere M&ouml;glichkeiten um eine Sicherung zu erstellen:</p><ul>
				<li><a href="http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CpanelDocs/BackupWizard">cPanel Backup Wizard</a></li><li><a href="http://download1.parallels.com/Plesk/PP11/11.5/Doc/en-US/online/plesk-customer-guide/index.htm?fileName=65203.htm">Parallel's Plesk Database Backup</a></li>
				<li><a href="http://doxfer.webmin.com/Webmin/MySQLDatabaseServer?sortcol=table;up=#Backing_up_and_restoring_a_datab">Webmin MySQL Module</a></li>
			</ul>
			Falls Ihr Hosting-Provider eine andere Software f&uuml;r die Benutzeroberfl&auml;che verwendet, fragen Sie diesen um eine entsprechende Dokumenation zur Erstellung einer Sicherung.
			<p></p>
			<h3>vBulletin auf Ihren Server hochladen</h3>
			<p>Das Aktualisieren von vBulletin ist in allen Versionen &auml;hnlich. Wenn Sie auf eine Version vor 5.0.0 aktualisieren, ist ein zus&auml;tzlicher Schritt notwendig.</p>
			<ol>
				<li>Bevor Sie fortfahren, sollten Sie im <a href="http://www.vbulletin.com/forum/">vBulletin.com Kundenforum</a> nach aktuellen Ank&uuml;ndigungen suchen.</li>
				<li>Bevor Sie fortfahren, sollten Sie eine vollst&auml;ndige Sicherung Ihrer Daten und Dateien machen.</li>
				<li>Falls Sie es noch nicht getan haben, entpacken Sie das heruntergeladene vBulletin-Paket. Dieses enth&auml;lt alle Dateien f&uuml;r vBulletin sowie einige Tools zur Unterst&uuml;tzung..</li>
				<li>Verbinden Sie sich mittels FTP-Programm mit Ihrem Server und rufen Sie das  <dfn title="In diesem Verzeichnis wird Ihr vBulletin-Forum installiert. Beispiel: /public_html/forums">vbulletin_root</dfn> (Hauptverzeichnis) auf.</li>
				<li><b>Wichtig</b>: Falls Sie von vBulletin Version 3 oder 4 aktualisieren, sichern Sie Ihre bestehende Dateien und l&ouml;schen Sie diese danach von Ihrem Server. vBulletin 5 muss in einem leeren Verzeichnis installiert werden. L&ouml;schen Sie nicht die Ordner attachments, customavatar, customprofilepic, oder signaturepics.</li>
				<li>Laden Sie nun den Inhalt des <code>Upload</code>-Ordners in das <dfn title="In diesem Verzeichnis wird Ihr vBulletin-Forum installiert. Beispiel: /public_html/forums">vbulletin_root</dfn> (Hauptverzeichnis) auf Ihrem Server hoch. Sie m&uuml;ssen nur die Inhalte des Ordners hochladen und nicht den Upload-Ordner selbst.</li>
				<li>Falls Sie gefragt werden, ob Sie die bestehenden Dateien &uuml;berschreiben wollen, w&auml;hlen Sie &quot;Ja, f&uuml;r alle&quot; aus.</li>
			</ol>				
			<h3>Den Upgrade-Assistent starten</h3>
			<p class="small">Falls Sie eine gro&szlig;e Seite (1.000.000 Beitr&auml;ge und mehr) haben, besuchen Sie bitte unser <a href="http://www.vbulletin.com/docs/html/upgrade_cli">Online-Handbuch</a> f&uuml;r weitere Informationen zur Aktualisierung mittels Kommandozeile.</p>			
			<ol>
				<li>Sobald Sie die Dateien in das gew&uuml;nschte Verzeichnis Ihres Servers hochgeladen haben, &ouml;ffnen Sie nun Ihren Web-Browser und geben Sie die folgende Adresse ein: <dfn title="In diesem Verzeichnis wird Ihr vBulletin-Forum installiert. Beispiel: /public_html/forums">vbulletin_root</dfn> plus install/upgrade.php.
			      <blockquote>Beispiel: http://www.example.com/forums/install/upgrade.php</blockquote></li>
				<li>Auf der ersten Seite werden Sie nach Ihrer Kundennummer gefragt. Geben Sie diese ein und klicken Sie danach auf &quot;Upgrade beginnen&quot;.</li>
				<li>Befolgen Sie die Schritte am Bildschirm. Einige Schritte dauern etwas l&auml;nger. Falls das Upgrade stoppt, aktualisieren Sie das Browserfenster und der Upgrade-Assistent setzt dort fort, wo der Prozess zuvor unterbrochen wurde.</li>
			</ol>
			<h3>Das Installationsverzeichnis l&ouml;schen</h3>
			<p>Sobald Sie vBulletin installiert haben, m&uuml;ssen Sie aus Sicherheitsgr&uuml;nden das Installationsverzeichnis l&ouml;schen. Der Ordner befindet sich im <dfn title="In diesem Verzeichnis wird die Kernebene und API von vBulletin installiert. Dies wird zu &#39;vbulletin_root/core&#39;. Beispiel: /public_html/forums/core">vbulletin_core (Kernebene)</dfn> Ihres Servers. L&ouml;schen Sie das gesamte Verzeichnis samt dessen Inhalte. Bevor dies nicht getan wurde, k&ouml;nnen Sie das Administrator-Kontrollzentrum nicht aufrufen.</p>
			<h3>H&auml;ufige Probleme beim Upgrade</h3>
			<dl class="faq">
				<dt>Nach der Aktualisierung sind alle meine Styles und Add-ons deaktiviert.</dt>
				<dd>Das ist absichtlich so. Styles und Add-ons aus Vorg&auml;ngerversionen sind nicht kompatibel und w&uuml;rden zu Problemen f&uuml;hren.</dd>
				<dt>W&auml;hrend des Upgrades wird mir ein Datenbankfehler angezeigt. Was soll ich tun?</dt>
				<dd>Besuchen Sie das Kundenforum und teilen Sie dort den Datenbankfehler mit.</dd>
				<dt>Es erscheint eine Meldung, dass der Upgrade-Prozess abgebrochen wurde. Was soll ich tun?</dt>
				<dd>Besuchen Sie das Kundenforum um Unterst&uuml;tzung bei dieser Fehlermeldung zu erhalten.</dd>
			
		    <div class="top"><a href="#top">HINAUF</a></div>
		  </dl>
		</section>
	</div>
	
	<a name="language"></a>
	<div class="wrap" id="language">
        <h2>Unterst&uuml;tzung anderer Sprachen</h2>
		<section>
			<p>Derzeit bieten wir Support in Englisch, Franz&ouml;sisch und Deutsch an. Andere Sprachen werden m&ouml;glicherweise zuk&uuml;nftig hinzugef&uuml;gt. Um andere Sprachen herunterzuladen, f&uuml;hren Sie folgende Schritte durch:
				</p><ol>
					<li>Melden Sie sich im <a href="http://members.vbulletin.com/">Kundenbereich</a> mit Ihrer Kundennummer (bzw. E-Mail-Adresse) und Ihrem Kennwort an.</li>
					<li>Klicken Sie auf "Download vBulletin 5 Connect".</li>
					<li>Auf der Downloadseite klicken Sie auf "More Download Options".</li>
					<li>Beim Punkt &quot;Additional Language&quot; k&ouml;nnen Sie zwischen Franz&ouml;sisch und Deutsch ausw&auml;hlen.</li>
					<li>Akzeptieren Sie die Lizenzbestimmungen und klicken Sie auf Download.</li>
					<li>Entpacken Sie den Inhalt des Downloadarchivs auf Ihren Computer.</li>
					<li>Laden Sie das Verzeichnis  /core/install auf Ihren Server und rufen Sie die URL ./core/install/upgrade.php in Ihrem Browser auf.</li>
					<li>Folgen Sie den Schritten am Bildschirm.</li>
					<li>Falls Sie weitere Sprachen installieren wollen, wiederholen Sie die oben angef&uuml;hrten Schritte.</li>
				</ol>
			<p></p>
			<p>Zus&auml;tzlich zu den offiziell angebotenen Sprachpaketen, finden Sie in Ihrem Administrator-Kontrollzentrum eine M&ouml;glichkeit um vBulletin in Ihre gew&uuml;nschte Sprache zu &uuml;bersetzen, oder um, von anderen Benutzern erstellte, Sprachpakete hochzuladen. Ihre Benutzer k&ouml;nnen ausw&auml;hlen, in welcher Sprache vBulletin verwendet wird. In unserem Forum finden Sie Hilfe zur Erstellung von Sprachpaketen:  <a href="http://www.vbulletin.com/forum/forumdisplay.php?f=87">http://www.vbulletin.com/forum/forumdisplay.php?f=87</a>*<br>
		    In diesem Forum finden Sie, von anderen Kunden erstellte Sprachpakete:		    <a href="http://www.vbulletin.com/forum/forumdisplay.php?f=96">http://www.vbulletin.com/forum/forumdisplay.php?f=96</a>*</p>
			<p>Beachten Sie bitte, dass mit Sprachpakete nur Systemtexte, nicht aber einzelne Beitr&auml;ge, &uuml;bersetzt werden. Die Beitr&auml;ge und Inhalte werden weiterhin in jener Sprache angezeigt, in welcher diese verfasst wurden. </p>
		    <div class="top"><a href="#top">HINAuF</a></div><hr>
		</section>
	</div>
		
	<a name="faq"></a>
	<div class="wrap" id="faq">
		<h2>H&auml;ufig gestellte Fragen</h2>
		<section>
			<p>Hier finden Sie h&auml;ufig gestellte Fragen (und deren Antworten) zu Beginn mit vBulletin.</p>
			<dl class="faq">
				<dt>Keines meiner vBulletin 3 oder vBulletin 4-Add-ons funktioniert.</dt>
					<dd>Diese werden in vBulletin 5 nicht unterst&uuml;tzt.</dd>
				<dt>Keiner meiner vBulletin 3 oder vBulletin 4-Styles funktioniert.</dt>
					<dd>Diese werden in vBulletin 5 nicht unterst&uuml;tzt. </dd>
				<dt>Ich habe vBulletin erfolgreich installiert aber es werden keine Formatierungen angezeigt.</dt>
					<dd>Sie m&uuml;ssen vBulletin so konfigurieren, damit es mit Ihrem Webserver funktioniert. Bei einem Apache 2-Server muss die Datei .htaccess im  <code>upload-</code>Verzeichnis hochgeladen werden. Bei einem IIS-Server muss auch das URL-Rewrite Modul von Microsoft installiert werden. Falls Sie NGINX verwenden, finden Sie eine vhosts-Datei im Verzeichnis  <code>do_not_upload</code>. Um diese Datei verwenden zu k&ouml;nnen, m&uuml;ssen Sie NGINX konfigurieren.</dd>
				<dt>Ich verwende Mac OS und siehe keine .htaccess-Datei im <code>upload</code>-Verzeichnis.</dt>
					<dd>&Ouml;ffnen Sie ein neues Terminal-Fenster und geben Sie den folgenden Befehl ein:
					  <blockquote><code>defaults write com.apple.Finder AppleShowAllFiles YES</code></blockquote>
					Nachdem Sie diesen Befehl ausgef&uuml;hrt haben, starten Sie Finder neu. Eine Kopie dieser Datei befindet sich auch im Upload-Verzeichnis namens htaccess.txt. Sie k&ouml;nnen die Datei hochladen und dann in .htaccess umbenennen.</dd>
				<dt>Wie kann ich Blogs, Gruppen und Alben deaktivieren?</dt>
				<dd>Das ist nicht m&ouml;glich. Sie k&ouml;nnen jedoch die Berechtigungen der Benutzer so einstellen, sodass Ihre Benutzer diese Funktionen nicht sehen k&ouml;nnen. Im Kundenforum erhalten Sie weitere Unterst&uuml;tzung dazu.</dd>
				<dt>Wie kann ich die Aktivit&auml;ten entfernen?</dt>
				<dd>Das ist nicht m&ouml;glich. Sie k&ouml;nnen jedoch den Tab deaktivieren, die Tabs neu anordnen und einen anderen Tab als Standard festlegen. Im Kundenforum erhalten Sie weitere Unterst&uuml;tzung dazu.</dd>
			</dl>
		    <div class="top"><a href="#top">HINAUF</a></div><hr>
		</section>
	</div>
	
	<a name="append"></a>
	<div class="wrap" id="appendix">
	    <h2>Anhang: Links f&uuml;r weitere Informationen</h2>
		<section>
			<p>Hier finden Sie einige wichtige Links zu weiterf&uuml;hrenden Informationen: </p>
			<ul type="disc">
				<li><b><a href="http://www.vbulletin.com/docs/html/">Das vBulletin Online-Handbuch</a></b> - mit Informationen zur Installation, Upgrades sowie zur Administration und Handhabung von vBulletin. </li>
				<li><b><a href="http://members.vbulletin.com/">Der vBulletin-Kundenbereich</a>^</b> - Hier k&ouml;nnen Sie vBulletin herunterladen und auf Support-Tickets zugreifen.</li>
				<li><b><a href="http://www.vbulletin.com/forum/">Das vBulletin-Kundenforum</a>*</b> - Kostenloses Kundenforum, aktuelle Ank&uuml;ndigungen mit detaillierten Informationen zu neuen Versionen.</li>
				<li><b><a href="https://members.vbulletin.com/changelog.php">vBulletin  &Auml;nderungshistorie der Ver&ouml;ffentlichungen</a>^</b> - Die &Auml;nderungshistorie verlinkt zu den Ank&uuml;ndigungen jeder vBulletin-Version. Diese Ank&uuml;ndigungen enthalten detailierte Informationen zu aktualisierten Dateien, Templates sowie Links zu den behobenen Fehlern.</li>
				<li><b><a href="http://tracker.vbulletin.com/browse/VBIV#selectedTab=com.atlassian.jira.plugin.system.project%3Achangelog-panel">vBulletin JIRA &Auml;nderungshistorie</a>*</b> - In dieser Liste finden Sie alle behobenen Fehler, neue Funktionen oder Verbesserungen.</li>
			</ul>
		    <div class="top"><a href="#top">HINAUF</a></div><hr>
		</section>
	</div>
	</div>
	
<footer>
    <p>Copyright 2000 - 2019 MH Sub I, LLC dba vBulletin. All rights reserved.<br>
    * Um das Kundenforum und JIRA verwenden zu k&ouml;nnen, m&uuml;ssen Sie &uuml;ber ein Benutzerkonto und einer g&uuml;ltigen Lizenz verf&uuml;gen.  ^ Um in den Kundenbereich zu gelangen, ben&ouml;tigen Sie eine g&uuml;ltige E-Mail-Adresse und Ihr Kennwort.</p>
		
</footer>



</body></html>
